content/posts/Introduction_to_symmetry_analysis_by_Brian_Cantwell_in_2002.md
+++
title = "Introduction to symmetry analysis by Brian Cantwell in 2002"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:34:47-04:00
slug = "Introduction_to_symmetry_analysis_by_Brian_Cantwell_in_2002"
draft = false
+++

## 1. Introduction to symmetry {#1-dot-introduction-to-symmetry}


### 1.4 The principle of covariance {#1-dot-4-the-principle-of-covariance}

<!--list-separator-->

-  Definition 1.2 (The principle ofcovariance). The equations thatgovern a phys\* ical law must retain the same appearance under certain group transformations of the variables that appear in the equations. This principle incorporates two somewhat distinct ideas.

    <!--list-separator-->

    -  (i) Coordinate independence – Physical phenomena must be governed by laws that do not depend on the coordinate system used to describe the phenomena.

    <!--list-separator-->

    -  (ii) Dimensional homogeneity – Physical phenomena must be described by laws that do not depend on the unit ofmeasure applied to the dimensions ofthe variables that describe the phenomena.

<!--list-separator-->

-  (i) Coordinate independence – Physical phenomena must be governed by laws that do not depend on the coordinate system used to describe the phenomena.

<!--list-separator-->

-  (ii) Dimensional homogeneity – Physical phenomena must be described by laws that do not depend on the unit ofmeasure applied to the dimensions ofthe variables that describe the phenomena.
